**데이터프레임 생성**

In [1]:
# 멤버의 이름을 가지는 벡터 만들기
memberNames <- c ('Mika','Josep','Kadar','Messi')

# 멤버의 나이를 가지는 벡터 만들기
memberAges <- c (27,45,31,46)

In [2]:
# 멤버의 이름과 나이를 칼럼으로 가지는 데이터 프레임으로 합치기 
Member <- data.frame(name = memberNames, age = memberAges)

In [3]:
Member

  name  age
1 Mika  27
2 Josep 45
3 Kadar 31
4 Messi 46

In [4]:
# 혈액형 칼럼을 추가하기 
Member$bloodType <- c('A','B','AB','O')

In [5]:
Member

  name  age bloodType
1 Mika  27  A
2 Josep 45  B
3 Kadar 31  AB
4 Messi 46  O

In [6]:
# 아이들의 나이 칼럼을 추가하기 
Member$childAge <- c(2,11,13,20)

In [7]:
# 멤버들이 각각 부모가 된 나이를 칼럼으로 가지는 ParenthoodAge칼럼 추가해보자.
Member$parenthoodAge = Member$age - Member$childAge

In [8]:
Member

  name  age bloodType childAge parenthoodAge
1 Mika  27  A          2       25
2 Josep 45  B         11       34
3 Kadar 31  AB        13       18
4 Messi 46  O         20       26

**Mika는 25살, Josep은 34살, Kadar는 18살, Messi는 26살에 부모가 되었음을 알 수 있다.**

**칼럼명 만 가져오기**

In [9]:
names(Member)

[1] "name"          "age"           "bloodType"     "childAge"
[5] "parenthoodAge"

**list()함수로 데이터 리스트 만들기**

In [10]:
Member_list = list(MemberNames,  MemberAges)

ERROR: Error in eval(expr, envir, enclos): 객체 'MemberNames'를 찾을 수 없습니다

In [11]:
Member_list

ERROR: Error in eval(expr, envir, enclos): 객체 'Member_list'를 찾을 수 없습니다

**cbind()함수로 데이터 묶기**

In [12]:
Member_Cbind = cbind(MemberNames,  MemberAges)

ERROR: Error in cbind(MemberNames, MemberAges): 객체 'MemberNames'를 찾을 수 없습니다

In [13]:
Member_Cbind

ERROR: Error in eval(expr, envir, enclos): 객체 'Member_Cbind'를 찾을 수 없습니다

**matrix: 4 × 2 of type chr 데이터 타입이 chr(문자형)이라는 것을 볼 수 있다. cbind()는 데이터 타입이 모두 같을 때 쓰면 유용하다.**

**as.Date() 날짜변수를 지정할때 쓴다.**

In [17]:
mikaBirth <- as.Date(c('1991-08-15'))
dannyBirth <- as.Date(c('1994-10-03'))

In [18]:
ageGap <- dannyBirth - mikaBirth

In [20]:
ageGap <- mikaBirth - dannyBirth

In [21]:
ageGap

Time difference of -1145 days

**데이터 프레임 내가 만들기**

In [25]:
name <- c('Ben','Martin','Andy','Paul')
birth_date <-as.Date(c('1977-07-23','1988-09-09','1973-09-01','1991-08-15'))
job <- c('Student','Professor','Student','Student')
friend <- c(5,4,3,2)
alchol <- c(10,12,2,1)
income <- c(2000,10000,40000,230000)

In [26]:
lectureData <-data.frame(name,birth_date,job,friend,alchol,income)

In [28]:
lectureData

  name   birth_date job       friend alchol income
1 Ben    1977-07-23 Student   5      10       2000
2 Martin 1988-09-09 Professor 4      12      10000
3 Andy   1973-09-01 Student   3       2      40000
4 Paul   1991-08-15 Student   2       1     230000

In [30]:
lectureData$job <-as.factor(lectureData$job)

In [31]:
lectureData

  name   birth_date job       friend alchol income
1 Ben    1977-07-23 Student   5      10       2000
2 Martin 1988-09-09 Professor 4      12      10000
3 Andy   1973-09-01 Student   3       2      40000
4 Paul   1991-08-15 Student   2       1     230000